languageComboBox.tooltip=Wybierz j\u0119zyk aplikacji
languagePane.text=J\u0119zyk
algorithmComboBox.tooltip=Wybierz algorytm haszuj\u0105cy, kt\u00F3ry chcesz przetestowa\u0107.\nAlgorytm haszuj\u0105cy okre\u015Bla spos\u00F3b dystrybucji i dost\u0119pu do danych w tabeli skr\u00F3t\u00F3w.\nR\u00F3\u017Cne algorytmy radz\u0105 sobie z kolizjami i dystrybucj\u0105 danych na r\u00F3\u017Cne sposoby, co mo\u017Ce znacz\u0105co wp\u0142yn\u0105\u0107 na wydajno\u015B\u0107.
hashTableSizeField.promptText=Rozmiar tabeli haszuj\u0105cej
hashTableSizeField.tooltip=Wprowad\u017A rozmiar tablicy skr\u00F3t\u00F3w.\nWarto\u015B\u0107 ta okre\u015Bla pocz\u0105tkow\u0105 pojemno\u015B\u0107 tablicy skr\u00F3t\u00F3w, kt\u00F3ra ma bezpo\u015Bredni wp\u0142yw na wydajno\u015B\u0107,\nszczeg\u00F3lnie pod wzgl\u0119dem obs\u0142ugi kolizji i wykorzystania pami\u0119ci.\nWprowad\u017A dodatni\u0105 liczb\u0119 ca\u0142kowit\u0105 wi\u0119ksz\u0105 ni\u017C 0.\nWi\u0119kszy rozmiar tabeli mo\u017Ce zmniejszy\u0107 liczb\u0119 kolizji, co poprawi wydajno\u015B\u0107, ale mo\u017Ce r\u00F3wnie\u017C spowodowa\u0107 u\u017Cycie wi\u0119kszej ilo\u015Bci pami\u0119ci.
chunkSizeField.promptText=Rozmiar chunka
chunkSizeField.tooltip=Wprowad\u017A rozmiar chunka danych, kt\u00F3ry ma zosta\u0107 poddany hashowaniu.\nWarto\u015B\u0107 ta okre\u015Bla liczb\u0119 znak\u00F3w, kt\u00F3re zostan\u0105 przetworzone w ka\u017Cdej operacji hashowania.\nWprowad\u017A liczb\u0119 ca\u0142kowit\u0105 dodatni\u0105 wi\u0119ksz\u0105 ni\u017C 0.\nWi\u0119kszy rozmiar fragmentu oznacza, \u017Ce wi\u0119cej danych zostanie poddanych hashowaniu na raz, co mo\u017Ce mie\u0107 wp\u0142yw zar\u00F3wno na wydajno\u015B\u0107, jak i wykorzystanie pami\u0119ci.
hashAlgorithmsPane.text=Algorytmy haszuj\u0105ce
hashFunctionChoice.tooltip=Wybierz co najmniej jedn\u0105 funkcj\u0119 haszuj\u0105c\u0105 do wykorzystania w testach.\nFunkcje haszuj\u0105ce to algorytmy mapuj\u0105ce dane o dowolnym rozmiarze na warto\u015Bci o sta\u0142ym rozmiarze.\nWyb\u00F3r wielu funkcji umo\u017Cliwia por\u00F3wnanie ich wydajno\u015Bci i odporno\u015Bci na kolizje.
hashFunctionsPane.text=Funkcje haszuj\u0105ce
testOperationsPane.text=Operacje testowe
testOperationsPane.tooltip=Wybierz co najmniej jedn\u0105 operacj\u0119 do wykonania podczas testu wydajno\u015Bci.\nDost\u0119pne operacje to:\n- Put: Wstawia dane do tabeli haszuj\u0105cej, pozwalaj\u0105c oceni\u0107 wydajno\u015B\u0107 wstawiania i rozwi\u0105zywania kolizji.\n- Get: Pobiera dane z tabeli haszuj\u0105cej, umo\u017Cliwiaj\u0105c ocen\u0119 szybko\u015Bci wyszukiwania i efektywno\u015Bci pobierania.\n- Delete: Usuwa dane z tabeli haszuj\u0105cej, pozwalaj\u0105c przetestowa\u0107 skuteczno\u015B\u0107 procesu usuwania i reorganizacji.
generateDataRadio.text=Generuj dane
generateDataRadio.tooltip=Wybierz t\u0119 opcj\u0119, aby generowa\u0107 syntetyczne dane do test\u00F3w wydajno\u015Bci.\nWygenerowane dane b\u0119d\u0105 u\u017Cywane podczas oceny wydajno\u015Bci algorytm\u00F3w haszuj\u0105cych.
dataSizeField.promptText=Rozmiar danych
dataSizeField.tooltip=Podaj rozmiar danych do wygenerowania na potrzeby test\u00F3w wydajno\u015Bci.\nTa warto\u015B\u0107 musi by\u0107 nieujemn\u0105 liczb\u0105 ca\u0142kowit\u0105 (np. 0 lub wi\u0119ksz\u0105).\nUwaga: dla niekt\u00F3rych algorytm\u00F3w, takich jak Linear Probing, ca\u0142kowite wype\u0142nienie tabeli mo\u017Ce prowadzi\u0107 do\nspadku wydajno\u015Bci lub niemo\u017Cno\u015Bci wstawienia wi\u0119kszej liczby element\u00F3w.\nUpewnij si\u0119, \u017Ce wybrany rozmiar danych nie ca\u0142kowicie wype\u0142nia tabeli, aby unikn\u0105\u0107 potencjalnych problem\u00F3w.
dataGenerationTimingSwitch.text=Generuj dane podczas dodawania testu:
dataGenerationTimingSwitch.tooltip=Wybierz, kiedy generowa\u0107 dane dla testu.\nJe\u015Bli w\u0142\u0105czone, dane b\u0119d\u0105 generowane podczas dodawania testu do listy.\nTo zapewnia, \u017Ce te same dane b\u0119d\u0105 u\u017Cywane za ka\u017Cdym razem, gdy test jest wykonywany, co daje sp\u00F3jne wyniki.\nJe\u015Bli wy\u0142\u0105czone, dane b\u0119d\u0105 generowane przy ka\u017Cdym uruchomieniu testu, co mo\u017Ce prowadzi\u0107 do r\u00F3\u017Cnych danych w ka\u017Cdym uruchomieniu,\npozwalaj\u0105c na szersz\u0105 ocen\u0119 wydajno\u015Bci algorytm\u00F3w w r\u00F3\u017Cnych warunkach.
generateDataPane.text=Dane
dataGenerationPane.text=Metody generowania danych
uniformCheckBox.text=R\u00F3wnomierny
uniformCheckBox.tooltip=Wybierz t\u0119 opcj\u0119, aby generowa\u0107 dane o jednolitym rozk\u0142adzie z zakresu znak\u00F3w ASCII (0 do 255).\nJednolity rozk\u0142ad zapewnia, \u017Ce ka\u017Cdy mo\u017Cliwy znak ASCII ma r\u00F3wn\u0105 szans\u0119 wyst\u0105pienia.\nTen rodzaj rozk\u0142adu danych jest przydatny do oceny, jak dobrze algorytm haszuj\u0105cy radzi sobie z r\u00F3wnomiernie rozmieszczonymi\ndanymi, dostarczaj\u0105c wgl\u0105du w obs\u0142ug\u0119 kolizji w warunkach idealnych.
generateUniformDataButton.text=Generuj pr\u00F3bk\u0119 danych r\u00F3wnomiernych
generateUniformDataButton.tooltip=Kliknij ten przycisk, aby wygenerowa\u0107 pr\u00F3bk\u0119 danych o jednolitym rozk\u0142adzie z zakresu znak\u00F3w ASCII (0 do 255).\nWygenerowane dane zostan\u0105 przedstawione na wykresie, pozwalaj\u0105c zaobserwowa\u0107 wzorzec jednolitego rozk\u0142adu.
uniformPane.text=R\u00F3wnomierny
gaussianCheckBox.text=Normalny
gaussianCheckBox.tooltip=Wybierz t\u0119 opcj\u0119, aby generowa\u0107 dane o rozk\u0142adzie normalnym (Gaussa).\nRozk\u0142ad normalny charakteryzuje si\u0119 dzwonowat\u0105 krzyw\u0105, gdzie wi\u0119kszo\u015B\u0107 warto\u015Bci koncentruje si\u0119\nwok\u00F3\u0142 \u015Bredniej, a mniej warto\u015Bci wyst\u0119puje dalej od niej.\nTen rodzaj rozk\u0142adu danych jest przydatny do oceny, jak dobrze algorytm haszuj\u0105cy radzi sobie\ndanymi, kt\u00F3re pod\u0105\u017Caj\u0105 za naturalnym wzorcem wyst\u0119puj\u0105cym w rzeczywisto\u015Bci, z klastrami podobnych warto\u015Bci.\nOkre\u015Bl \u015Bredni\u0105 i odchylenie standardowe, aby kontrolowa\u0107 centrum i rozk\u0142ad danych.
meanField.promptText=\u015Arednia
meanField.tooltip=Podaj warto\u015B\u0107 \u015Bredniej dla rozk\u0142adu normalnego (Gaussa).\n\u015Arednia musi by\u0107 liczb\u0105 zmiennoprzecinkow\u0105, reprezentuj\u0105c\u0105 \u015Brodek rozk\u0142adu, gdzie wi\u0119kszo\u015B\u0107 punkt\u00F3w danych b\u0119dzie si\u0119 skupia\u0107.\nWi\u0119ksza \u015Brednia przesunie rozk\u0142ad na wy\u017Csze warto\u015Bci, a mniejsza na ni\u017Csze.
deviationField.promptText=Odchylenie
deviationField.tooltip=Podaj warto\u015B\u0107 odchylenia standardowego dla rozk\u0142adu normalnego (Gaussa).\nOdchylenie standardowe musi by\u0107 dodatni\u0105 liczb\u0105 zmiennoprzecinkow\u0105, kt\u00F3ra kontroluje rozpi\u0119to\u015B\u0107 rozk\u0142adu.\nWi\u0119ksze odchylenie standardowe skutkuje szerszym rozk\u0142adem danych wok\u00F3\u0142 \u015Bredniej,\npodczas gdy mniejsze warto\u015B\u0107 utrzymuje dane bli\u017Cej \u015Bredniej.
generateGaussianDataButton.text=Generuj pr\u00F3bk\u0119 danych normalnych
generateGaussianDataButton.tooltip=Kliknij ten przycisk, aby wygenerowa\u0107 pr\u00F3bk\u0119 danych o rozk\u0142adzie normalnym (Gaussa).\nWygenerowane dane b\u0119d\u0105 oparte na podanej \u015Bredniej i odchyleniu standardowym, co pozwala na wizualizacj\u0119 wzorca rozk\u0142adu na wykresie.
gaussianPane.text=Normalny
exponentialCheckBox.text=Wyk\u0142adniczy
exponentialCheckBox.tooltip=Wybierz t\u0119 opcj\u0119, aby generowa\u0107 dane o rozk\u0142adzie wyk\u0142adniczym.\nRozk\u0142ad wyk\u0142adniczy jest cz\u0119sto u\u017Cywany do modelowania czasu mi\u0119dzy niezale\u017Cnymi zdarzeniami zachodz\u0105cymi ze sta\u0142\u0105 \u015Bredni\u0105 cz\u0119sto\u015Bci\u0105.\nTen rodzaj rozk\u0142adu danych jest przydatny do oceny wydajno\u015Bci algorytm\u00F3w haszuj\u0105cych w warunkach,\ngdzie dane maj\u0105 wi\u0119ksze prawdopodobie\u0144stwo wyst\u0119powania blisko pocz\u0105tku, ale z malej\u0105cym prawdopodobie\u0144stwem wi\u0119kszych warto\u015Bci.\nOkre\u015Bl warto\u015B\u0107 lambda (wsp\u00F3\u0142czynnik), aby kontrolowa\u0107 rozk\u0142ad i cz\u0119stotliwo\u015B\u0107 wyst\u0119powania warto\u015Bci w danych.
lambdaField.promptText=Lambda
lambdaField.tooltip=Podaj warto\u015B\u0107 lambda (wsp\u00F3\u0142czynnik) dla rozk\u0142adu wyk\u0142adniczego.\nLambda musi by\u0107 dodatni\u0105 liczb\u0105 zmiennoprzecinkow\u0105, reprezentuj\u0105c\u0105 cz\u0119sto\u015B\u0107 wyst\u0119powania warto\u015Bci w rozk\u0142adzie.\nWi\u0119ksza warto\u015B\u0107 lambda powoduje skupienie danych bli\u017Cej pocz\u0105tku rozk\u0142adu, wskazuj\u0105c na wy\u017Csz\u0105 cz\u0119sto\u015B\u0107 wyst\u0119powania.
generateExponentialDataButton.text=Generuj pr\u00F3bk\u0119 danych wyk\u0142adniczych
generateExponentialDataButton.tooltip=Kliknij ten przycisk, aby wygenerowa\u0107 pr\u00F3bk\u0119 danych o rozk\u0142adzie wyk\u0142adniczym.\nWygenerowane dane b\u0119d\u0105 oparte na podanej warto\u015Bci lambda (wsp\u00F3\u0142czynnik), a wynik zostanie przedstawiony na wykresie, aby lepiej zrozumie\u0107 wzorzec rozk\u0142adu.
exponentialPane.text=Wyk\u0142adniczy
fileChooserButton.text=Wybierz plik
fileChooserButton.tooltip=Kliknij ten przycisk, aby otworzy\u0107 okno eksploratora plik\u00F3w i wybra\u0107 plik, z kt\u00F3rego dane zostan\u0105 za\u0142adowane.\nObs\u0142ugiwane s\u0105 tylko formaty plik\u00F3w tekstowych (np. .txt, .csv).
loadDataRadio.text=Za\u0142aduj z pliku
loadDataRadio.tooltip=Wybierz t\u0119 opcj\u0119, aby za\u0142adowa\u0107 dane z zewn\u0119trznego pliku.\nWybieraj\u0105c t\u0119 opcj\u0119, mo\u017Cesz u\u017Cy\u0107 niestandardowych zbior\u00F3w danych zapisanych w pliku, co pozwala na bardziej elastyczne scenariusze testowe.
dataLoadingTimingSwitch.text=Za\u0142aduj dane w trakcie dodawania testu:
dataLoadingTimingSwitch.tooltip=Wybierz, kiedy za\u0142adowa\u0107 dane z pliku.\nJe\u015Bli ta opcja jest w\u0142\u0105czona, dane zostan\u0105 za\u0142adowane podczas dodawania testu do listy, co zapewni, \u017Ce\nte same dane b\u0119d\u0105 u\u017Cywane za ka\u017Cdym razem, gdy test zostanie uruchomiony, zapewniaj\u0105c sp\u00F3jne wyniki.\nJe\u015Bli ta opcja jest wy\u0142\u0105czona, dane b\u0119d\u0105 \u0142adowane za ka\u017Cdym razem, gdy test zostanie wykonany,\npozwalaj\u0105c na zmienno\u015B\u0107, co mo\u017Ce by\u0107 przydatne do oceny wydajno\u015Bci w nieco innych warunkach za ka\u017Cdym razem.
dataSourcePane.text=\u017Br\u00F3d\u0142o danych
benchmarkIterationsField.promptText=Iteracje benchmarku
benchmarkIterationsField.tooltip=Podaj liczb\u0119 iteracji dla benchmarku.\nTa warto\u015B\u0107 musi by\u0107 dodatni\u0105 liczb\u0105 ca\u0142kowit\u0105 wi\u0119ksz\u0105 od 0.\nBenchmark oblicza silni\u0119 liczby 20 wielokrotnie, aby zebra\u0107 wiarygodne dane dotycz\u0105ce wydajno\u015Bci.\nWi\u0119cej iteracji daje dok\u0142adniejsze wyniki benchmarku, ale wyd\u0142u\u017Ca czas jego trwania.\nZalecana liczba iteracji to od 100 do 1000, w zale\u017Cno\u015Bci od balansu mi\u0119dzy precyzj\u0105 a czasem trwania testu.
benchmarkThresholdField.promptText=Pr\u00F3g benchmarku
benchmarkThresholdField.tooltip=Podaj warto\u015B\u0107 progu benchmarku.\nMusi to by\u0107 dodatnia liczba zmiennoprzecinkowa.\nJe\u015Bli r\u00F3\u017Cnica mi\u0119dzy kolejnymi \u015Brednimi iteracji spadnie poni\u017Cej tej warto\u015Bci, benchmark zako\u0144czy si\u0119 wcze\u015Bniej.\nZalecane warto\u015Bci to od 0.001 do 0.01, aby uzyska\u0107 dobre po\u0142\u0105czenie precyzji i efektywno\u015Bci.\nWprowadzenie warto\u015Bci ujemnej spowoduje wykonanie wszystkich iteracji.
benchmarkParamsPane.text=Parametry benchmarku
testIterationsField.promptText=Iteracje testu
testIterationsField.tooltip=Wprowad\u017A liczb\u0119 iteracji dla testu wydajno\u015Bci.\nWarto\u015B\u0107 ta musi by\u0107 dodatni\u0105 liczb\u0105 ca\u0142kowit\u0105 wi\u0119ksz\u0105 ni\u017C 0.\nTest jest powtarzany wielokrotnie, aby upewni\u0107 si\u0119, \u017Ce wyniki s\u0105 wiarygodne i nie s\u0105 wp\u0142ywane przez chwilowe warunki systemowe.\nWi\u0119ksza liczba iteracji zazwyczaj zapewnia dok\u0142adniejsze wyniki, ale wyd\u0142u\u017Ca czas wykonania testu.\nZalecana liczba iteracji to od 50 do 500, w zale\u017Cno\u015Bci od po\u017C\u0105danego balansu mi\u0119dzy precyzj\u0105 a czasem potrzebnym na wykonanie testu.
testThresholdField.promptText=Threshold testu
testThresholdField.tooltip=Wprowad\u017A pr\u00F3g do wcze\u015Bniejszego zako\u0144czenia iteracji testowych.\nWarto\u015B\u0107 ta musi by\u0107 dodatni\u0105 liczb\u0105 zmiennoprzecinkow\u0105.\nJe\u015Bli r\u00F3\u017Cnica mi\u0119dzy \u015Brednimi wynikami kolejnych iteracji spadnie poni\u017Cej tego progu, test zako\u0144czy si\u0119 wcze\u015Bniej, aby zaoszcz\u0119dzi\u0107 czas.\nZalecane warto\u015Bci mieszcz\u0105 si\u0119 w przedziale od 0,001 do 0,01, aby osi\u0105gn\u0105\u0107 dobry balans mi\u0119dzy precyzj\u0105 a efektywno\u015Bci\u0105.\nWprowadzenie liczby ujemnej spowoduje wykonanie wszystkich iteracji.
warmupIterationsField.promptText=Iteracje rozgrzewki
warmupIterationsField.tooltip=Wprowad\u017A liczb\u0119 iteracji rozgrzewkowych.\nMusi to by\u0107 dodatnia liczba ca\u0142kowita.\nIteracje rozgrzewkowe s\u0105 u\u017Cywane do stabilizacji systemu i minimalizacji wp\u0142ywu optymalizacji JVM, co zapewnia bardziej wiarygodne wyniki test\u00F3w.\nZalecana liczba iteracji to od 10 do 50, aby odpowiednio przygotowa\u0107 si\u0119 do test\u00F3w wydajno\u015Bci.
additionalSettingsPane.text=Dodatkowe Ustawienia
runTestButton.text=Uruchom wybrane testy
runTestButton.tooltip=Kliknij ten przycisk, aby wykona\u0107 wszystkie wybrane testy.\nTesty skonfigurowane z okre\u015Blonymi parametrami zostan\u0105 wykonane kolejno, a dane dotycz\u0105ce wydajno\u015Bci zostan\u0105 zebrane do analizy.
addTestButton.text=Dodaj test
addTestButton.tooltip=Kliknij ten przycisk, aby doda\u0107 test z obecnie skonfigurowanymi parametrami.\nTest zostanie zapisany na li\u015Bcie i mo\u017Ce zosta\u0107 uruchomiony p\u00F3\u017Aniej.
removeTestButton.text=Usu\u0144 wybrane testy
removeTestButton.tooltip=Kliknij ten przycisk, aby usun\u0105\u0107 wybrane testy z listy.\nUpewnij si\u0119, \u017Ce wybra\u0142e\u015B testy, kt\u00F3re chcesz usun\u0105\u0107, poniewa\u017C tej operacji nie mo\u017Cna cofn\u0105\u0107.
exportSelectedTestsButton.text=Eksportuj wybrane testy
exportSelectedTestsButton.tooltip=Kliknij ten przycisk, aby wyeksportowa\u0107 wybrane testy do pliku JSON.\nPozwala to zapisa\u0107 konfiguracje test\u00F3w na przysz\u0142o\u015B\u0107 lub udost\u0119pni\u0107 je innym osobom.
importTestsButton.text=Importuj testy
importTestsButton.tooltip=Kliknij ten przycisk, aby zaimportowa\u0107 konfiguracje test\u00F3w z pliku JSON.\nUmo\u017Cliwia to za\u0142adowanie wcze\u015Bniej zapisanych test\u00F3w lub konfiguracji udost\u0119pnionych przez innych.
loadCSVFileButton.text=Wczytaj wyniki
loadCSVFileButton.tooltip=Kliknij ten przycisk, aby wczyta\u0107 wyniki wydajno\u015Bci z pliku CSV.\nPozwala to przegl\u0105da\u0107 i analizowa\u0107 wyniki uzyskane wcze\u015Bniej w \u015Brodowisku testowym.
